{"id":"dec_0021","category":"high_intent_decision","title":"Friends ditched me on my 21st birthday after I paid for a $1000 Airbnb","body":"Last week was my 21st birthday, and I shared the party with one of my close friends since we were born on the same day. We decided to splurge and rent out a $1000 Airbnb with a hot tub, a pool, and nine bedrooms so both friend groups could stay over. I was really excited and spent the whole week planning out everything, I even spent a lot of money on goodie bags for everyone.\n\nThe plan for the night was to pregame at the house, then head into the city, and later come back to the Airbnb to hang out, open gifts, and relax. But the night completely fell apart. After going to a couple of clubs, everyone slowly drifted into their own plans—some left with other people, some went to different bars, and no one told me anything. I remember standing outside one of the clubs feeling very alone on my own birthday after paying thousands to set everything up.\n\nMy friend who shared the birthday was upset too, which made me feel less crazy, but it didn’t make the situation hurt less. I felt frustrated, embarrassed, and heartbroken. Part of me kept replaying the night in my head, wondering if I did something wrong or if they even cared. Another part of me felt stupid for trying so hard when they've shown signs of being selfish before. Deep down I was afraid this was who they truly were. I kept wondering if I should drop them, but another part of me feared being completely alone. Since I do online school, making new friends is hard. I wasn’t sure if I should confront them or forgive them. Now I feel stuck choosing between keeping friends who hurt me or risking having none at all.","word_count":310,"paragraph_count":3,"language":"en","decision_type":"Interpersonal boundary decision","options_count":2,"emotions":["hurt","embarrassed","heartbroken","frustrated"],"emotion_intensity":0.82,"reasoning_structure":"Emotion-driven internal conflict: replaying events, assessing previous patterns, weighing loneliness vs self-respect.","biases":["negativity bias","projection of past behavior onto current event","fear-driven loss aversion","emotional reasoning"],"certainty":"Low","final_decision_present":false,"conflict_type":"Interpersonal conflict; friendship rejection; social abandonment; emotional betrayal","complexity":"High","context":"A 21st birthday celebration at a rented Airbnb collapses when the friend group abandons the birthday hosts during the night, resulting in emotional turmoil and re-evaluation of friendships.","options":["Drop the friend group and accept temporary loneliness to protect self-respect.","Keep the friend group and hope they do not repeat this behavior."],"criteria":["self-respect","fear of loneliness","past patterns of behavior","difficulty of making new friends"],"emotional_weight":"High","logical_weight":"Medium-Low","reasoning_steps":["I prepared and spent money on the Airbnb and party items.","Friends drifted away without communicating.","I felt hurt and abandoned on my birthday.","I replayed the events, questioning whether I caused it.","I recalled past selfish behavior from the group.","I compared the pain of betrayal to the fear of losing all friends.","I considered confronting them versus letting it go.","No final decision has been made; I am stuck between two options."]}
